software-engineering/monitor/falcon-practices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>open-falcon 实践</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">open-falcon 实践</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5752e62">1. 简介</a></li>
<li><a href="#org2e0758d">2. 数据上报字段</a>
<ul>
<li><a href="#orgfede20b">2.1. 示例</a></li>
<li><a href="#org1817499">2.2. metric</a></li>
<li><a href="#orgf6997e0">2.3. value</a></li>
<li><a href="#orgd75f98c">2.4. endpoint</a></li>
<li><a href="#org48b8bdb">2.5. tag</a></li>
<li><a href="#org238571e">2.6. timestamp</a></li>
<li><a href="#org709b6f1">2.7. step</a></li>
<li><a href="#orgacd055b">2.8. counterType</a></li>
</ul>
</li>
<li><a href="#org1cb08b5">3. 监控视图</a>
<ul>
<li><a href="#orgecad781">3.1. project</a></li>
<li><a href="#orgbe7bbde">3.2. screen</a></li>
<li><a href="#org0dd246c">3.3. graph</a></li>
<li><a href="#orge1d4e1d">3.4. counter</a></li>
</ul>
</li>
<li><a href="#org830ce59">4. 告警</a>
<ul>
<li><a href="#org67fd501">4.1. 配置告警接收人</a></li>
<li><a href="#orgbf5fce9">4.2. 创建 hostgroup</a></li>
<li><a href="#org77dc8ac">4.3. 创建策略模板</a></li>
<li><a href="#orgffce034">4.4. 告警函数</a></li>
</ul>
</li>
<li><a href="#org6cd9898">5. 实践与优化</a></li>
</ul>
</div>
</div>


<div id="outline-container-org5752e62" class="outline-2">
<h2 id="org5752e62"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
详细使用需要阅读<a href="http://book.open-falcon.org/zh_0_2/">open-falcon 手册</a>。
</p>

<p>
下面明确一些概念（concept）：
</p>
</div>
</div>

<div id="outline-container-org2e0758d" class="outline-2">
<h2 id="org2e0758d"><span class="section-number-2">2</span> 数据上报字段</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfede20b" class="outline-3">
<h3 id="orgfede20b"><span class="section-number-3">2.1</span> 示例</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #a1db00;">"metric"</span>: <span style="color: #ff4ea3;">"cpu.idle"</span>,
    <span style="color: #a1db00;">"endpoint"</span>: `hostname`,
    <span style="color: #a1db00;">"tags"</span>: <span style="color: #ff4ea3;">""</span>,
    <span style="color: #a1db00;">"value"</span>: <span style="color: #5fafd7;">12.34</span>,
    <span style="color: #a1db00;">"timestamp"</span>: `date +%s`,
    <span style="color: #a1db00;">"step"</span>: <span style="color: #5fafd7;">60</span>,
    <span style="color: #a1db00;">"counterType"</span>: <span style="color: #ff4ea3;">"GAUGE"</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1817499" class="outline-3">
<h3 id="org1817499"><span class="section-number-3">2.2</span> metric</h3>
<div class="outline-text-3" id="text-2-2">
<p>
metric 即监控指标的名称，比如 disk.io.util、load.1min、df.bytes.free.percent。
</p>
</div>
</div>

<div id="outline-container-orgf6997e0" class="outline-3">
<h3 id="orgf6997e0"><span class="section-number-3">2.3</span> value</h3>
<div class="outline-text-3" id="text-2-3">
<p>
value 就是这个监控指标的值。
</p>
</div>
</div>

<div id="outline-container-orgd75f98c" class="outline-3">
<h3 id="orgd75f98c"><span class="section-number-3">2.4</span> endpoint</h3>
<div class="outline-text-3" id="text-2-4">
<p>
endpoint 是这个监控指标所依附的实体，一般设置为 机器的 hostname 或 IP。
</p>
</div>
</div>

<div id="outline-container-org48b8bdb" class="outline-3">
<h3 id="org48b8bdb"><span class="section-number-3">2.5</span> tag</h3>
<div class="outline-text-3" id="text-2-5">
<p>
监控指标的属性标签，对 metric 进一步描述和细化,。取值是一组逗号分割的键值对，例如 <code>project=foo,module=bar</code> 。
</p>
</div>
</div>

<div id="outline-container-org238571e" class="outline-3">
<h3 id="org238571e"><span class="section-number-3">2.6</span> timestamp</h3>
<div class="outline-text-3" id="text-2-6">
<p>
表示上报监控指标时的时间戳，注意是整数，代表的是秒
</p>
</div>
</div>

<div id="outline-container-org709b6f1" class="outline-3">
<h3 id="org709b6f1"><span class="section-number-3">2.7</span> step</h3>
<div class="outline-text-3" id="text-2-7">
<p>
step 是 监控数据的上报周期，这对于后续的配置监控策略很重要，必须明确指定。
</p>

<p>
step 是 rrdtool 中的概念，Falcon 后端存储用的 rrdtool，我们需要告诉 rrdtool 这个数据多长时间 push 上来一次。
</p>
</div>
</div>

<div id="outline-container-orgacd055b" class="outline-3">
<h3 id="orgacd055b"><span class="section-number-3">2.8</span> counterType</h3>
<div class="outline-text-3" id="text-2-8">
<p>
counterType 也是 rrdtool 中的概念，目前 Open-Falcon 支持两种类型数据类型：
</p>
<ul class="org-ul">
<li>COUNTER：指标在存储和展现的时候，会被计算为 speed，即（当前值 - 上次值）/ 时间间隔</li>
<li>GAUGE：即用户上传什么样的值，就原封不动的存储</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org1cb08b5" class="outline-2">
<h2 id="org1cb08b5"><span class="section-number-2">3</span> 监控视图</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgecad781" class="outline-3">
<h3 id="orgecad781"><span class="section-number-3">3.1</span> project</h3>
<div class="outline-text-3" id="text-3-1">
<p>
代表一个项目，可以有多个 screen。
</p>
</div>
</div>

<div id="outline-container-orgbe7bbde" class="outline-3">
<h3 id="orgbe7bbde"><span class="section-number-3">3.2</span> screen</h3>
<div class="outline-text-3" id="text-3-2">
<p>
视图，里面可以有多个 graph。
</p>
</div>
</div>

<div id="outline-container-org0dd246c" class="outline-3">
<h3 id="org0dd246c"><span class="section-number-3">3.3</span> graph</h3>
<div class="outline-text-3" id="text-3-3">
<p>
展示监控曲线，每条曲线对应一个 counter：
</p>
</div>
</div>

<div id="outline-container-orge1d4e1d" class="outline-3">
<h3 id="orge1d4e1d"><span class="section-number-3">3.4</span> counter</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
counter=$metric/sorted($tags)
</pre>
</div>
</div>
</div>

<div id="outline-container-org830ce59" class="outline-2">
<h2 id="org830ce59"><span class="section-number-2">4</span> 告警</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org67fd501" class="outline-3">
<h3 id="org67fd501"><span class="section-number-3">4.1</span> 配置告警接收人</h3>
<div class="outline-text-3" id="text-4-1">
<p>
创建告警通知的 team，并添加成员。
</p>
</div>
</div>

<div id="outline-container-orgbf5fce9" class="outline-3">
<h3 id="orgbf5fce9"><span class="section-number-3">4.2</span> 创建 hostgroup</h3>
<div class="outline-text-3" id="text-4-2">
<p>
创建告警针对的 hostgroup，包含告警的机器。
</p>
</div>
</div>

<div id="outline-container-org77dc8ac" class="outline-3">
<h3 id="org77dc8ac"><span class="section-number-3">4.3</span> 创建策略模板</h3>
<div class="outline-text-3" id="text-4-3">
<p>
创建告警策略，template
</p>
</div>
</div>

<div id="outline-container-orgffce034" class="outline-3">
<h3 id="orgffce034"><span class="section-number-3">4.4</span> 告警函数</h3>
<div class="outline-text-3" id="text-4-4">
<p>
参见 <a href="https://book.open-falcon.org/zh_0_2/usage/func.html">告警函数</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org6cd9898" class="outline-2">
<h2 id="org6cd9898"><span class="section-number-2">5</span> 实践与优化</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://zhuanlan.zhihu.com/p/25951941">Mt-Falcon——Open-Falcon 在美团点评的应用与实践</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
